package Study.JavaCore.Seminars.Seminar_02.task_05;

public class Main {

    /*
    Написать метод, осуществляющий сортировку одномерного
    массива подсчётом. Важное ограничение состоит в том, что для этой
    сортировки диапазон значений исходного массива должен находиться в
    разумных пределах, например, не более 1000.
    x[2, 1, 0, 4, 3, 0, 0, 1, 2] → t[3(x0
    ), 2(x1
    ), 2(x2
    ), 1(x3
    ), 1(x4
    )] → x[0, 0, 0, 1, 1, 2, 2, 3, 4]
     */

    public static void main(String[] args) {

    }
}
